
extern "C" {

/***************************************************/
/*  cmp_cipher():密码校验函数                      */
/*    s1:输入参数1,明文或密文,固定6字节数字或字母  */
/*    s2:输出参数2,明文或密文,固定6字节数字或字母  */
/*  输出:密码校验成功，返回0                       */
/***************************************************/
int cmp_cipher(char *s1,char *s2);

/***************************************************/
/*  de_cipher():解密函数                           */
/*    src:输入参数,密文,固定6字节字母              */
/*    dst:输出参数,明文,固定6字节数字              */
/***************************************************/
void de_cipher(char *src,char *dst);

/***************************************************/
/*  en_cipher():加密函数                           */
/*    src:输入参数,明文,固定6字节数字              */
/*    dst:输出参数,密文,固定6字节字母              */
/***************************************************/
void en_cipher(char *src,char *dst);

}

